# LoadFrom Method (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RevitLinkType..::..LoadFrom Method
RevitLinkType Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| LoadFrom(ExternalResourceReference, WorksetConfiguration) | Loads or reloads the Revit link. The link will be loaded from the location given in the input ExternalResourceReference. |
| LoadFrom(ModelPath, WorksetConfiguration) | Loads or reloads the Revit link from disk or cloud. The link will be loaded from the input path. |

# See Also
RevitLinkType Class
RevitLinkType Members
Autodesk.Revit.DB Namespace